Si6gma/FRDM-MCXA153/SDK_24/middleware/se_hostlib/sss/src/fsl_sss_util_asn1_der.c
    /* Get Public Exponent */
    ret            = asn_1_parse_tlv(pBuf, &taglen, &bufIndex);
    temp_pubExplen = taglen;
    if (*pubExplen < temp_pubExplen) {
        LOG_E("pubExp overflow");
        goto exit;
    }
    *pubExplen = temp_pubExplen;
    if (*pubExplen > 0) {
        ENSURE_OR_GO_EXIT(bufIndex <= (keylen - (*pubExplen)));
        memcpy(pubExp, pBuf + bufIndex, *pubExplen);
        ENSURE_OR_GO_EXIT((SIZE_MAX - bufIndex) >= *pubExplen);
        bufIndex += *pubExplen;
        status = kStatus_SSS_Success;
    }
exit:
    return status;
}

sss_status_t sss_util_asn1_rsa_parse_public(
    const uint8_t *key, size_t keylen, uint8_t **modulus, size_t *modlen, uint8_t **pubExp, size_t *pubExplen)
{
    uint8_t *pBuf   = (uint8_t *)key;
    size_t taglen   = 0;
    size_t bufIndex = 0;
    int ret;
    sss_status_t status = kStatus_SSS_Fail;
    //int tag = (key[1] == 0x82) ? 4 : 3;
    /* Parse Header Information
    Public Key contains 3 Sequences as header */
    ENSURE_OR_GO_EXIT(bufIndex < keylen);
    ret = asn_1_parse_tlv(pBuf, &taglen, &bufIndex); /* ASN.1 Sequence */
    if (ret != 0) {
        goto exit;
    }
    ret = asn_1_parse_tlv(pBuf, &taglen, &bufIndex); /* Public Header Nested TLV */
    if (ret != 0) {
        goto exit;
    }
    ENSURE_OR_GO_EXIT((SIZE_MAX - bufIndex) >= taglen);
    bufIndex += taglen;

    /* Bit-String + NULL Byte */
    ret = asn_1_parse_tlv(pBuf, &taglen, &bufIndex);
    if (ret != 0) {
        goto exit;
    }

    ENSURE_OR_GO_EXIT((SIZE_MAX - 1) >= bufIndex);
    bufIndex++;

    ret = asn_1_parse_tlv(pBuf, &taglen, &bufIndex); /* Sequence of interger*/
    if (ret != 0) {
        goto exit;
    }
    /* Get the Modulus*/
    ret = asn_1_parse_tlv(pBuf, &taglen, &bufIndex);
    if (ret != 0) {
        goto exit;
    }
    ENSURE_OR_GO_EXIT(bufIndex < keylen);
    if (pBuf[bufIndex] == 0x00) {
        if (taglen) {
            *modlen = taglen - 1; /*Exclude Starting Null*/
            ENSURE_OR_GO_EXIT((SIZE_MAX - 1) >= bufIndex);
            bufIndex++;
        }
        else {
            goto exit;
        }
    }
    else {
        *modlen = taglen;
    }
    *modulus = SSS_MALLOC(*modlen);
    if ((*modulus != NULL) && ((*modlen) > 0)) {
        ENSURE_OR_GO_EXIT(bufIndex <= (keylen - (*modlen)));
        memcpy(*modulus, pBuf + bufIndex, *modlen);
        ENSURE_OR_GO_EXIT((SIZE_MAX - bufIndex) >= *modlen);
        bufIndex += *modlen;
    }
    else {
        LOG_E("Either malloc failed or improper length");
        goto exit;
    }

    /* Get Public Exponent */
    ret        = asn_1_parse_tlv(pBuf, &taglen, &bufIndex);
    *pubExplen = taglen;
    *pubExp    = SSS_MALLOC(*pubExplen);
    if (*pubExp == NULL) {
        LOG_E("malloc failed");
        goto exit;
    }
    if (*pubExplen > 0) {
        ENSURE_OR_GO_EXIT(bufIndex <= (keylen - (*pubExplen)));
        memcpy(*pubExp, pBuf + bufIndex, *pubExplen);
        ENSURE_OR_GO_EXIT((SIZE_MAX - bufIndex) >= *pubExplen);
        bufIndex += *pubExplen;
        status = kStatus_SSS_Success;
    }
exit:
    return status;
}

sss_status_t sss_util_asn1_rsa_get_public(
    uint8_t *key, size_t *keylen, uint8_t *modulus, size_t modlen, uint8_t *pubExp, size_t pubExplen)
{
    sss_status_t status = kStatus_SSS_Fail;
    size_t pbkeylen     = 0;
    size_t index        = 0;
    size_t intModLEn    = modlen + 1; // RSA Key has null byte before moduls start

    ENSURE_OR_GO_EXIT(
        (modlen + pubExplen + sizeof(grsa1kPubHeader) + 3U + 3U) < (size_t)(1UL << ((sizeof(size_t) * 4) - 1)));
    ENSURE_OR_GO_EXIT(key != NULL);
    ENSURE_OR_GO_EXIT(keylen != NULL);
    ENSURE_OR_GO_EXIT(modulus != NULL);
    ENSURE_OR_GO_EXIT(pubExp != NULL);

    pbkeylen = modlen + pubExplen + sizeof(grsa1kPubHeader) + 3U + 3U;

    if (*keylen < pbkeylen) {
        LOG_E("Buffer not sufficient");
        goto exit;
    }

    /* Copy the Public Header According to key bit len*/
    if (modlen == 0x40) {
        ENSURE_OR_GO_EXIT(sizeof(grsa512PubHeader) <= *keylen);
        memcpy(key, grsa512PubHeader, sizeof(grsa512PubHeader));
        index += sizeof(grsa512PubHeader);
    }
    else if (modlen == 0x80) {
        ENSURE_OR_GO_EXIT(sizeof(grsa1kPubHeader) <= *keylen);
        memcpy(key, grsa1kPubHeader, sizeof(grsa1kPubHeader));
        index += sizeof(grsa1kPubHeader);
    }
    else if (modlen == 0x90) {
        ENSURE_OR_GO_EXIT(sizeof(grsa1152PubHeader) <= *keylen);
        memcpy(key, grsa1152PubHeader, sizeof(grsa1152PubHeader));
        index += sizeof(grsa1152PubHeader);
    }
    else if (modlen == 0x100) {
        ENSURE_OR_GO_EXIT(sizeof(grsa2kPubHeader) <= *keylen);
        memcpy(key, grsa2kPubHeader, sizeof(grsa2kPubHeader));
        index += sizeof(grsa2kPubHeader);
    }
    else if (modlen == 0x180) {
        ENSURE_OR_GO_EXIT(sizeof(grsa3kPubHeader) <= *keylen);
        memcpy(key, grsa3kPubHeader, sizeof(grsa3kPubHeader));
        index += sizeof(grsa3kPubHeader);
    }
    else if (modlen == 0x200) {
        ENSURE_OR_GO_EXIT(sizeof(grsa4kPubHeader) <= *keylen);
        memcpy(key, grsa4kPubHeader, sizeof(grsa4kPubHeader));
        index += sizeof(grsa4kPubHeader);
    }
    if (intModLEn < modlen) {
        goto exit;
    }

    if (intModLEn < 0x7f) {
        ENSURE_OR_GO_EXIT(index + 1 <= *keylen);
        key[index++] = (uint8_t)intModLEn;
    }
    else if (intModLEn < 0xFF) {
        ENSURE_OR_GO_EXIT(index + 2 <= *keylen);
        key[index++] = 0x81;
        key[index++] = (uint8_t)intModLEn;
    }
    else {
        ENSURE_OR_GO_EXIT(index + 3 <= *keylen);
        ENSURE_OR_GO_EXIT((intModLEn >> 8) <= UINT8_MAX);
        key[index++] = 0x82;
        key[index++] = (uint8_t)(intModLEn >> 8);
        key[index++] = (uint8_t)intModLEn & 0xFF;
    }

    ENSURE_OR_GO_EXIT(index + 1 + modlen <= *keylen);
    key[index++] = 0x00; // Null byte
    memcpy(key + index, modulus, modlen);
    index += modlen;

    /*Copy the public Exponent*/
    ENSURE_OR_GO_EXIT(index + 1 + 1 + pubExplen <= *keylen);
    key[index++] = 0x02;                    // tag
    key[index++] = (uint8_t)pubExplen;      // length
    memcpy(key + index, pubExp, pubExplen); // value
    index += pubExplen;
    *keylen = index;
    status  = kStatus_SSS_Success;
exit:
    return status;
}

