Si6gma/FRDM-MCXA153/SDK_24/middleware/se_hostlib/sss/src/fsl_sss_util_asn1_der.c
    ENSURE_OR_GO_EXIT((*pubkeyIndex) < inLen);
    ENSURE_OR_GO_EXIT((*prvkeyIndex) < inLen);
    ENSURE_OR_GO_EXIT(((*prvkeyIndex) + (*privateKeyLen)) <= inLen);
    ENSURE_OR_GO_EXIT((UINT_MAX - (*pubkeyIndex)) >= (*publicKeyLen));
    ENSURE_OR_GO_EXIT(((*pubkeyIndex) + (*publicKeyLen)) <= inLen);
    status = kStatus_SSS_Success;
exit:
    return status;
}

sss_status_t sss_util_openssl_write_pkcs12(const char *pkcs12_cert,
    const char *password,
    const char *ref_key,
    long ref_key_length,
    const char *cert,
    long cert_length)
{
    sss_status_t retval = kStatus_SSS_Fail;

#if SSS_HAVE_HOSTCRYPTO_OPENSSL
    FILE *pkcs12_file;
    X509 *x509_cert = 0;
    EVP_PKEY *p_key = 0;
    PKCS12 *p12;
    BIO *pem_key_bio  = BIO_new(BIO_s_mem());
    BIO *pem_cert_bio = BIO_new(BIO_s_mem());

    ENSURE_OR_GO_EXIT(pkcs12_cert != NULL);
    ENSURE_OR_GO_EXIT(password != NULL);
    ENSURE_OR_GO_EXIT(ref_key != NULL);
    ENSURE_OR_GO_EXIT(cert != NULL);

    // Parse Private key
    ENSURE_OR_GO_EXIT(ref_key_length <= INT_MAX);
    BIO_write(pem_key_bio, ref_key, ref_key_length);
    PEM_read_bio_PrivateKey(pem_key_bio, &p_key, NULL, NULL);
    ENSURE_OR_GO_EXIT(p_key != NULL);

    ENSURE_OR_GO_EXIT(cert_length <= INT_MAX);
    BIO_write(pem_cert_bio, cert, cert_length);
    PEM_read_bio_X509(pem_cert_bio, &x509_cert, NULL, NULL);
    ENSURE_OR_GO_EXIT(x509_cert != NULL);

    // Generate PKCS12 key and certificate
#if (OPENSSL_VERSION_NUMBER < 0x10100000L)
    p12 = PKCS12_create((char *)password,
#else
    p12 = PKCS12_create(password,
#endif
        NULL,
        p_key,
        x509_cert,
        NULL,
        0,
        0,
        PKCS12_DEFAULT_ITER,
        1,
        NID_key_usage);
    if (p12 == NULL) {
        retval = kStatus_SSS_Fail;
        goto exit;
    }

    //write into file
    pkcs12_file = fopen(pkcs12_cert, "wb");
    if (i2d_PKCS12_fp(pkcs12_file, p12) != 1) {
        retval = kStatus_SSS_Fail;
    }

    if (pkcs12_file != NULL) {
        if (fclose(pkcs12_file) != 0) {
            LOG_E("fclose error");
        }
    }
    retval = kStatus_SSS_Success;
#else
    AX_UNUSED_ARG(pkcs12_cert);
    AX_UNUSED_ARG(password);
    AX_UNUSED_ARG(ref_key);
    AX_UNUSED_ARG(ref_key_length);
    AX_UNUSED_ARG(cert);
    AX_UNUSED_ARG(cert_length);
    retval = kStatus_SSS_Fail;
    goto exit;
#endif

exit:
    return retval;
}
